# Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список. Тобто, в результаті повинен вийти список із 2-х списків.

# Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.

# Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.

# Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній, у списку парна кількість елементів і в списку непарна кількість елементів.

# [1, 2, 3, 4, 5, 6] => [[1, 2, 3], [4, 5, 6]]
# [1, 2, 3] => [[1, 2], [3]]
# [1, 2, 3, 4, 5] => [[1, 2, 3], [4, 5]]
# [1] => [[1], []]
# [] => [[], []]

import math

res = []

example_list = [1, 2, 3, 4, 5, 6]
example_list_length = len(example_list)

half_list = math.ceil(example_list_length / 2)

res.extend(
    [
        example_list[:half_list],
        example_list[half_list:],
    ]
)

print(res)
